#+TITLE: Code Club meeting
#+PROPERTY: header-args:R :session *R:codeclub* :colnames yes
#+OPTIONS: ^:{}
#+AUTHOR: Ilja J. Kocken

Today we're going to apply a stratigraphic age-model to convert our core's
depth to age. This time I, [[https://www.uu.nl/staff/IJKocken][Ilja Kocken]], am presenting, and since I don't use
RStudio I give you the [[emacs][emacs]] [[https://orgmode.org/][org-mode]] source code for this analysis. If you're
interested in what's happening, check out the raw button on the top-right in
github to see the text file that creates this fancy thingie.

Don't worry though, it's very similar to RMarkdown and you should be able to
follow along just fine!

* apply age model
Let's apply the age model with piecewise linear interpolation, using the ~approx~
function from base R.

# again, use #+BEGIN_SRC R :var smps=samples to use read.csv in org.
#+NAME: approx
#+BEGIN_SRC R
  smps <- read_csv("samples.csv")

  aged_smps <- smps %>%
    ## simplify the tibble by removing some columns (not necessary, but nicer for printing)
    select(HOLE, CORE, CORE_TYPE, SECTION, CC, TOP_DEPTH, BOTTOM_DEPTH, VOLUME, MBSF_TOP, MCD_TOP, label) %>%
    ## add a new column
    mutate(age=with(agemodel, # this makes the column names of agemodel available
                              # to everything in parentheses.
                    approx(`Midpoint depth (mbsf)`, `Age (Ma)`,
                           ## xout specifies the new depth values that we want to
                           ## interpolate to.
                           xout=smps$MCD_TOP))$y)  # we need to subset only y,
                                                   # the new age, from the
                                                   # resulting list
#+END_SRC

#+RESULTS: approx
| HOLE | CORE | CORE_TYPE | SECTION | CC | TOP_DEPTH | BOTTOM_DEPTH | VOLUME | MBSF_TOP | MCD_TOP | label   |              age |
|------+------+-----------+---------+----+-----------+--------------+--------+----------+---------+---------+------------------|
| C    |    4 | H         |       7 | no |        61 |           63 |     10 |   109.62 |  115.97 | IK1-001 | 32.8171097804391 |
| C    |    4 | H         |       7 | no |        63 |           65 |     10 |   109.64 |  115.99 | IK1-002 | 32.8176447105788 |
| C    |    5 | H         |       1 | no |        60 |           62 |     10 |    110.1 |   118.2 | IK1-003 |  32.876754491018 |
| C    |    5 | H         |       1 | no |        62 |           64 |     10 |   110.12 |  118.22 | IK1-004 | 32.8772894211577 |
| C    |    5 | H         |       1 | no |        64 |           66 |     10 |   110.14 |  118.24 | IK1-005 | 32.8778243512974 |
| C    |    5 | H         |       1 | no |        66 |           68 |     10 |   110.16 |  118.26 | IK1-006 | 32.8783592814371 |
| C    |    5 | H         |       1 | no |        68 |           70 |     10 |   110.18 |  118.28 | IK1-007 | 32.8788942115768 |
| B    |   16 | H         |       5 | no |       106 |          108 |     10 |   140.66 |  147.46 | IK2-026 | 33.7749417535254 |
| B    |   16 | H         |       5 | no |       108 |          110 |     10 |   140.68 |  147.48 | IK2-027 | 33.7753341508277 |
| B    |   16 | H         |       5 | no |       110 |          112 |     10 |    140.7 |   147.5 | IK2-028 |   33.77572654813 |
| B    |   16 | H         |       5 | no |       112 |          114 |     10 |   140.72 |  147.52 | IK2-029 | 33.7761189454323 |
| B    |   16 | H         |       5 | no |       114 |          116 |     10 |   140.74 |  147.54 | IK2-030 | 33.7765113427345 |
| B    |   16 | H         |       5 | no |       116 |          118 |     10 |   140.76 |  147.56 | IK2-031 | 33.7769037400368 |
| C    |    9 | H         |       1 | no |        92 |           94 |     10 |   145.42 |  155.62 | IK3-017 |  33.935039852851 |
| C    |    9 | H         |       1 | no |        94 |           96 |     10 |   145.44 |  155.64 | IK3-018 | 33.9354322501533 |
| C    |    9 | H         |       1 | no |        96 |           98 |     10 |   145.46 |  155.66 | IK3-019 | 33.9358246474555 |
| C    |    9 | H         |       1 | no |        98 |          100 |     10 |   145.48 |  155.68 | IK3-020 | 33.9362170447578 |
| C    |    9 | H         |       1 | no |       100 |          102 |     10 |    145.5 |   155.7 | IK3-021 | 33.9366094420601 |
| C    |    9 | H         |       1 | no |       102 |          104 |     10 |   145.52 |  155.72 | IK3-022 | 33.9370018393624 |
| C    |    9 | H         |       1 | no |       104 |          106 |     10 |   145.54 |  155.74 | IK3-023 | 33.9373942366646 |
| C    |    9 | H         |       1 | no |       106 |          108 |     10 |   145.56 |  155.76 | IK3-024 | 33.9377866339669 |
| C    |    9 | H         |       1 | no |       108 |          110 |     10 |   145.58 |  155.78 | IK3-025 | 33.9381790312692 |
| B    |   20 | H         |       2 | no |        14 |           16 |     10 |   173.24 |  191.84 | IK4-040 |  35.619565701559 |
| B    |   20 | H         |       2 | no |        16 |           18 |     10 |   173.26 |  191.86 | IK4-041 | 35.6202227171492 |
| B    |   20 | H         |       2 | no |        18 |           20 |     10 |   173.28 |  191.88 | IK4-042 | 35.6208797327394 |
| B    |   20 | H         |       2 | no |        20 |           22 |     10 |    173.3 |   191.9 | IK4-043 | 35.6215367483296 |
| B    |   20 | H         |       2 | no |        22 |           24 |     10 |   173.32 |  191.92 | IK4-044 | 35.6221937639198 |
| B    |   20 | H         |       2 | no |        24 |           26 |     10 |   173.34 |  191.94 | IK4-045 |   35.62285077951 |
| B    |   20 | H         |       2 | no |        26 |           28 |     10 |   173.36 |  191.96 | IK4-046 | 35.6235077951002 |

* age model function
We can also define a function first, for later use in plotting:

#+BEGIN_SRC R :results output
  agemodel_function <- with(agemodel, approxfun(`Midpoint depth (mbsf)`, `Age (Ma)`))
  agemodel_function
#+END_SRC

#+RESULTS:
: Warning message:
: In regularize.values(x, y, ties, missing(ties)) :
:   collapsing to unique 'x' values
:
: function (v)
: .approxfun(x, y, v, method, yleft, yright, f)
: <bytecode: 0x561f08cd7420>
: <environment: 0x561f08cd6b28>

This highlights that there are some overlapping x values. We'll talk about dealing with those in a future session, see also [[*More advanced age model analysis][More advanced age model analysis]].

* combine measurements with sample info
You have some measurements or new data that you don't want to enter into your
massive file, because then you'd have to find the correct line each time.

The below table is in the ~tidy~ format. This means that each observation gets
one row.

#+tblname: measurements
| label   | measure | value | date             |
|---------+---------+-------+------------------|
| IK1-002 | d18O    |   -.2 | <2019-06-26 Wed> |
| IK1-002 | d13C    |     1 | <2019-06-25 Tue> |
| IK1-002 | D47     |  0.78 | <2019-06-26 Wed> |
| IK2-030 | d18O    |    .5 | <2019-06-28 Fri> |
| IK2-030 | d13C    |    -1 | <2019-06-29 Sat> |
| IK2-030 | D47     |    .7 | <2019-06-28 Fri> |
| IK3-025 | d18O    |   -.1 | <2019-05-15 Wed> |
| IK3-025 | d13C    |    .3 | <2019-05-15 Wed> |
| IK3-025 | D47     |    .9 | <2019-05-16 Thu> |
| IK4-044 | d18O    |    .1 | <2019-05-28 Tue> |
| IK4-044 | d13C    |    .3 | <2019-05-15 Wed> |
| IK4-044 | D47     |    .6 | <2019-05-22 Wed> |

Now how do we add all the info to it?

We ~left_join~ them together, which means that it'll take all the rows in the
left side, look for the column's label (should have the same name in both
tibbles) in the right hand side and bind them together accordingly.
# #+begin_src R :var meas=measurements
#+begin_src R
  meas <- read_csv("data.csv")

  meas_info <- meas %>%
    left_join(aged_smps, by="label")
#+end_src

#+RESULTS:
| label   | measure | value | date             | HOLE | CORE | CORE_TYPE | SECTION | CC | TOP_DEPTH | BOTTOM_DEPTH | VOLUME | MBSF_TOP | MCD_TOP |              age |
|---------+---------+-------+------------------+------+------+-----------+---------+----+-----------+--------------+--------+----------+---------+------------------|
| IK1-002 | d18O    |  -0.2 | <2019-06-26 Wed> | C    |    4 | H         |       7 | no |        63 |           65 |     10 |   109.64 |  115.99 | 32.8176447105788 |
| IK1-002 | d13C    |     1 | <2019-06-25 Tue> | C    |    4 | H         |       7 | no |        63 |           65 |     10 |   109.64 |  115.99 | 32.8176447105788 |
| IK1-002 | D47     |  0.78 | <2019-06-26 Wed> | C    |    4 | H         |       7 | no |        63 |           65 |     10 |   109.64 |  115.99 | 32.8176447105788 |
| IK2-030 | d18O    |   0.5 | <2019-06-28 Fri> | B    |   16 | H         |       5 | no |       114 |          116 |     10 |   140.74 |  147.54 | 33.7765113427345 |
| IK2-030 | d13C    |    -1 | <2019-06-29 Sat> | B    |   16 | H         |       5 | no |       114 |          116 |     10 |   140.74 |  147.54 | 33.7765113427345 |
| IK2-030 | D47     |   0.7 | <2019-06-28 Fri> | B    |   16 | H         |       5 | no |       114 |          116 |     10 |   140.74 |  147.54 | 33.7765113427345 |
| IK3-025 | d18O    |  -0.1 | <2019-05-15 Wed> | C    |    9 | H         |       1 | no |       108 |          110 |     10 |   145.58 |  155.78 | 33.9381790312692 |
| IK3-025 | d13C    |   0.3 | <2019-05-15 Wed> | C    |    9 | H         |       1 | no |       108 |          110 |     10 |   145.58 |  155.78 | 33.9381790312692 |
| IK3-025 | D47     |   0.9 | <2019-05-16 Thu> | C    |    9 | H         |       1 | no |       108 |          110 |     10 |   145.58 |  155.78 | 33.9381790312692 |
| IK4-044 | d18O    |   0.1 | <2019-05-28 Tue> | B    |   20 | H         |       2 | no |        22 |           24 |     10 |   173.32 |  191.92 | 35.6221937639198 |
| IK4-044 | d13C    |   0.3 | <2019-05-15 Wed> | B    |   20 | H         |       2 | no |        22 |           24 |     10 |   173.32 |  191.92 | 35.6221937639198 |
| IK4-044 | D47     |   0.6 | <2019-05-22 Wed> | B    |   20 | H         |       2 | no |        22 |           24 |     10 |   173.32 |  191.92 | 35.6221937639198 |

